// Задача HARD STAT необязательная: Задайте массив случайных целых чисел. Найдите максимальный элемент 
// и его индекс, минимальный элемент и его индекс, среднее арифметическое всех элементов. Сохранить эту 
// инфу в отдельный массив и вывести на экран с пояснениями. Найти медианное значение первоначалального 
// массива , возможно придется кое-что для этого дополнительно выполнить.

// старт
// создание и заполнение массива случайных целых (int) чисел;
// функция нахождения максимального элемента и его индекса (к функции MaxNuber добавить в цикл переменную CurrentIndexMax)
// функция нахождения минимального элемента и его индекса (к функции MinNuber добавить в цикл переменную CurrentIndexMin)
// функция нахождения среднего арифметического через суммирование всех элементов и деление на размер массива
// создание нового массива и заполнение данными, полученных результатов
// блок вывода на экран результирующего массива с пояснениями
// функция нахождения медианного значения первого массива
// вывод на экран результата
// конец